---
jupyter:
  jupytext:
    text_representation:
      extension: .md
      format_name: markdown
      format_version: '1.3'
      jupytext_version: 1.15.2
  kernelspec:
    display_name: Python 3 (ipykernel)
    language: python
    name: python3
---

## Стек (stack).  Использование основных операций со стеком для решения прикладных задач

<!-- #region -->
### Цель работы

Изучение структуры данных «Стек», а также основных операций над ним.

#### Реализация стека со всеми требованиями почти по ГОСТу
```angular2html
class Stack:
    def __init__(self):
        self.__data = []

    def write(self, value):
        self.__data.insert(0, value)

    def is_empty(self):
        return len(self.__data) == 0

    def delete(self):
        if self.is_empty():
            raise Exception("Нечего удалять - стек пустой!")
        else:
            element = self.__data[0]
            self.__data.pop(0)
            return element

    def read_top(self):
        if self.is_empty():
            raise Exception("Нечего считывать - стек пустой!")
        return self.__data[0]

    def clear(self):
        self.__data.clear()

    def display(self):
        print(self.__data)
```

### Приложение

```angular2html
def main():
    stack = Stack()
    while True:
        print("1: Запись значения в стек")
        print("2: Удаление значения из стека")
        print("3: Просмотр верхнего значения стека")
        print("4: Очистка стека")
        print("5: Просмотр всего стека")
        print("6: Выход")
        try:
            choice = int(input("Выберите действие: "))

            if choice == 1:
                value = input("Введите значение для записи в стек: ")
                stack.write(value)
            elif choice == 2:
                print("Удаленное значение: ", stack.delete())
            elif choice == 3:
                print("Верхнее значение стека: ", stack.read_top())
            elif choice == 4:
                stack.clear()
                print("Стек очищен.")
            elif choice == 5:
                print("Весь стек: ")
                stack.display()
            elif choice == 6:
                print("Выход из программы.")
                break
            else:
                print("Неправильный ввод. Попробуйте еще раз.")
        except ValueError:
            print("Ввод должен быть числом. Попробуйте еще раз.")
        except Exception as e:
            print(f"Произошла ошибка: {str(e)}")


if __name__ == "__main__":
    main()
```

### Дополнительные задания

**Задание 1.**

Используя операции со стеком, написать программу, проверяющую своевременность закрытия скобок «(, ), [, ] ,{, }» в строке символов (строка состоит из одних скобок этих типов).

В процессе решения анализируются символы строки. Если встречена одна из открывающихся скобок, то она записывается в стек. При обнаружении
закрывающейся скобки, соответствующей скобке, находящейся в вершине стека, последняя удаляется. При несоответствии скобки выдается сообщение об ошибке, которое фиксируется в логической переменной.

```angular2html
stack = Stack()
print("Введите строку из скобочек")
string = input()
for i in range(len(string)):
    if string[i] == '(' or string[i] == '[' or string[i] == '{':
        stack.write(string[i])
    elif string[i] == ')' or string[i] == ']' or string[i] == '}':
        if not stack.is_empty() and stack.read_top() == '(' and string[i] == ')':
            stack.delete()
        elif not stack.is_empty() and stack.read_top() == '[' and string[i] == ']':
            stack.delete()
        elif not stack.is_empty() and stack.read_top() == '{' and string[i] == '}':
            stack.delete()
        else:
            raise Exception("Скобки не совпадают!")
print("Задание выполнено! Стек выглядел так:")
stack.display()
stack.clear()
```

**Задание 2.**

Написать программу вычисления значения выражения, представленного в обратной польской записи (в постфиксной записи). Выражение состоит из цифр от 1 до 9 и знаков операции.

| Обычная (инфиксная) запись | Обратная польская (постфиксная) запись |
|:---|:---|
| (a+b) * c    | a b + c *       |
|  a + (b+c)*d | a b c + d * +   |

Просматривая строку, анализируем очередной символ, если это:
 - цифра, то записываем ее в стек;
 - знак, то читаем два элемента из стека, выполняем математическую операцию, определяемую этим знаком, и заносим результат в стек.

После просмотра всей строки в стеке должен оставаться один элемент, он и является решением задачи.

```angular2html
print("Задание 2.")
print("Введите строку из цифр и арифметических знаков, например: 574+3*+")
string = input()
for i in range(len(string)):
    if string[i].isdigit():
        stack.write(string[i])
    elif string[i] in '+-*/':
        if not stack.is_empty():
            if (stack.read_top()).isdigit():
                item1 = int(stack.read_top())
                stack.delete()
        else:
            raise Exception("Нет достаточного количества чисел для проведения операции")

        if not stack.is_empty():
            if (stack.read_top()).isdigit():
                item2 = int(stack.read_top())
                stack.delete()
        else:
            raise Exception("Нет достаточного количества чисел для проведения операции")

        if string[i] == '+':
            stack.write(str(item1 + item2))
        if string[i] == '-':
            stack.write(str(item1 - item2))
        if string[i] == '*':
            stack.write(str(item1 * item2))
        if string[i] == '/':
            stack.write(str(item1 / item2))

stack.display()
print("Задание выполнено!")
```

<!-- #region jp-MarkdownHeadingCollapsed=true -->
### Контрольные вопросы

1. Что такое динамическая структура данных?
```angular2html
Динамические структуры данных – это структуры данных, память под которые выделяется и освобождается по мере необходимости в процессе выполнения программы, а не в момент ее запуска. Динамические структуры данных в процессе существования в памяти могут изменять не только число составляющих их элементов, но и характер связей между элементами.
```
2. Что такое стек?
```angular2html
Стек — это специальный тип списка, в котором все операции вставки и удаления выполняются только на одном конце, называемом вершиной (top).
```
3. Особенности выполнения операций со стеком.
```angular2html
В любой момент времени можно получить доступ только к верхнему элементу стека.
```
4. Основные операции со стеком.
```angular2html
1) Запись элемента в стек
2) Просмотр стека
3) Удаление элемента из стека
4) Проверка стека на пустоту
5) Очистка стека
6) Чтение вершины стека
```
<!-- #endregion -->
